# DATA UNDERSTANDING

In [75]:
import pysal
import pandas
import mapnik
!python --version

Python 2.7.11 :: Anaconda 4.0.0 (x86_64)

---
### Blocks People

In [57]:
db_blocks_people = pysal.open('./dataset/Data/CLT_BlockGroups_Attr.dbf','r')
#print map(lambda x: str(x), db.header)
df_blocks_people = pandas.DataFrame(db_blocks_people[0:-1], columns=db_blocks_people.header)
df_blocks_people[0:2]

,STATEFP10,COUNTYFP10,TRACTCE10,BLKGRPCE10,GEOID10,NAMELSAD10,MTFCC10,FUNCSTAT10,ALAND10,AWATER10,INTPTLAT10,INTPTLON10,ARPCIncome,ARPerHEdu,ARPerWork,ARPerMI5L,ARPerRMI5L,ARPer3MU
0,37,119,005301,1,371190053011,Block Group 1,G5030,S,3692032,0,+35.2582845,-080.8060757,12375.0,7.486865,69.674647,73.998045,68.132942,82.098765
1,37,119,001400,2,371190014002,Block Group 2,G5030,S,1051009,0,+35.2437169,-080.8024062,39139.0,13.474495,83.140878,55.172414,25.689655,27.016645

---
### Blocks

In [61]:
db_blocks = pysal.open('./dataset/Data/CLT_Blocks_Attr.dbf','r')
df_blocks = pandas.DataFrame(db_blocks[0:-1], columns=db_blocks.header)
df_blocks[0:2]

,STATEFP10,COUNTYFP10,TRACTCE10,BLOCKCE,BLOCKID10,PARTFLG,ARPopDen,ARPerAA,ARHeteInx,ARPerM1724,ARPerHOwn,ARPerSF
0,37,119,005401,2028,371190054012028,N,0.000116,97.590361,0.047322,3.614458,84.615385,33.333333
1,37,119,004600,2025,371190046002025,N,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000

---
### Crime per Street

In [70]:
db_crime_per_street = pysal.open('./dataset/Data/CLT_Streets_crmCntAUNCC_Business.dbf','r')
df_crime_per_street = pandas.DataFrame(db_crime_per_street[0:-1], columns=db_crime_per_street.header)
df_crime_per_street[0:5]

            WHOLESTNAM  crmCntAUNC  BusinCnt
0  Carolina Academy Rd           2         0
1  Carolina Academy Rd           0         0
2       Churchfield Ln           0         0
3          Westmill Ln           0         0
4       Wade Ardrey Rd           0         0

---
### Something

In [74]:
db_some = pysal.open('./dataset/Data/CLT_Business_Attri.dbf','r')
df_some = pandas.DataFrame(db_some[0:-1], columns=db_some.header)
df_some[0:1]

,OBJECTID,Join_Count,ID,NUM_ADDR,NUMADD_M,Match_,year_,Quarter,NAICS,CntCode,...,extra_Info,NewAdd11,emp_old,tempadd,StrMapped,WHOLESTNAM,WHOLESTN_F,ST_NAME,ST_NAME_LA,StrMapID
0,18421,1,48567.0,339743,339743,g,2008.0,1.0,531210.0,119,...,0,0,4,0,0,LANCASTER HWY,LANCASTER HY,LANCASTER,HY,28294

---

In [ ]:
import shapefile as shp
import matplotlib.pyplot as plt

sf = shp.Reader("./dataset/Data/POI_WALMART.shp")

plt.figure()
for shape in sf.shapeRecords():
    x = [i[0] for i in shape.shape.points[:]]
    y = [i[1] for i in shape.shape.points[:]]
    plt.plot(x,y)
plt.show()

In [ ]:
import numpy as np
from matplotlib import pyplot as p  #contains both numpy and pyplot
x1 = [-1,-1,10,10,-1]; 
y1 = [-1,10,10,-1,-1]
x2 = [21,21,29,29,21]; 
y2 = [21,29,29,21,21]
shapes = [[x1,y1],[x2,y2]]
for shape in shapes:
  x,y = shape
  p.plot(x,y)
p.show()